server/loadtest.yaml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Isinma"
    - duration: 60
      arrivalRate: 20
      name: "Yuksek Trafik"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "API Testi"
    flow:
      - get:
          url: "/api/movies"